SmartkomDev/GraftCore/graftcore/boards.txt
menu.clock=Clock
menu.BOD=BOD
menu.pinout=Pinout
menu.resetpin=Reset pin
menu.bootloader=Bootloader


####################
#### Graft Uno ####
####################

# General
graft_uno.name=Graft Uno
graft_uno.upload.tool=avrdude
graft_uno.upload.maximum_data_size=6144
graft_uno.upload.speed=115200
graft_uno.bootloader.tool=avrdude
graft_uno.build.core=coreX-corefiles
graft_uno.build.board=AVR_ATmega4809
graft_uno.build.mcu=atmega4809
graft_uno.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
graft_uno.bootloader.WDTCFG=0x00
graft_uno.bootloader.TCD0CFG=0x00
graft_uno.bootloader.SYSCFG1=0x06
graft_uno.bootloader.APPEND=0x00
graft_uno.bootloader.LOCKBIT=0xC5

# Pinouts
graft_uno.menu.pinout.uno=rev 1.0
graft_uno.menu.pinout.uno.build.variant=graft-uno
graft_uno.menu.pinout.uno.build.compat=

# Reset pin
graft_uno.menu.resetpin.reset=Reset
graft_uno.menu.resetpin.reset.bootloader.SYSCFG0=0xC9
graft_uno.menu.resetpin.gpio=GPIO
graft_uno.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
graft_uno.menu.BOD.2v6=BOD 2.6V
graft_uno.menu.BOD.2v6.bootloader.BODCFG=0x54
graft_uno.menu.BOD.4v2=BOD 4.2V
graft_uno.menu.BOD.4v2.bootloader.BODCFG=0xF4
graft_uno.menu.BOD.4v0=BOD 4.0V
graft_uno.menu.BOD.4v0.bootloader.BODCFG=0xD4
graft_uno.menu.BOD.3v7=BOD 3.7V
graft_uno.menu.BOD.3v7.bootloader.BODCFG=0xB4
graft_uno.menu.BOD.3v3=BOD 3.3V
graft_uno.menu.BOD.3v3.bootloader.BODCFG=0x94
graft_uno.menu.BOD.2v9=BOD 2.9V
graft_uno.menu.BOD.2v9.bootloader.BODCFG=0x74
graft_uno.menu.BOD.2v1=BOD 2.1V
graft_uno.menu.BOD.2v1.bootloader.BODCFG=0x34
graft_uno.menu.BOD.1v8=BOD 1.8V
graft_uno.menu.BOD.1v8.bootloader.BODCFG=0x14
graft_uno.menu.BOD.disabled=BOD disabled
graft_uno.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
graft_uno.menu.clock.internal_20MHz=Internal 20 MHz
graft_uno.menu.clock.internal_20MHz.upload.speed=115200
graft_uno.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
graft_uno.menu.clock.internal_20MHz.build.oscillator=
graft_uno.menu.clock.internal_20MHz.build.f_cpu=20000000L

graft_uno.menu.clock.internal_16MHz=Internal 16 MHz
graft_uno.menu.clock.internal_16MHz.upload.speed=115200
graft_uno.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_16MHz.build.oscillator=
graft_uno.menu.clock.internal_16MHz.build.f_cpu=16000000L

graft_uno.menu.clock.internal_8MHz_div=Internal 8 MHz
graft_uno.menu.clock.internal_8MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_8MHz_div.build.oscillator=
graft_uno.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

graft_uno.menu.clock.internal_4MHz_div=Internal 4 MHz
graft_uno.menu.clock.internal_4MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_4MHz_div.build.oscillator=
graft_uno.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

graft_uno.menu.clock.internal_2MHz_div=Internal 2 MHz
graft_uno.menu.clock.internal_2MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_2MHz_div.build.oscillator=
graft_uno.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

graft_uno.menu.clock.internal_1MHz_div=Internal 1 MHz
graft_uno.menu.clock.internal_1MHz_div.upload.speed=115200
graft_uno.menu.clock.internal_1MHz_div.bootloader.OSCCFG=0x01
graft_uno.menu.clock.internal_1MHz_div.build.oscillator=
graft_uno.menu.clock.internal_1MHz_div.build.f_cpu=1000000L


# Bootloader
graft_uno.menu.bootloader.uart2_alternative=Bootloader
graft_uno.menu.bootloader.uart2_alternative.upload.maximum_size=48640
graft_uno.menu.bootloader.uart2_alternative.upload.protocol=arduino
graft_uno.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
graft_uno.menu.bootloader.uart2_alternative.upload.extra_params=
graft_uno.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
graft_uno.menu.bootloader.uart2_alternative.bootloader.file=optiboot/graft_bootloader/graft_uno.hex
graft_uno.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
graft_uno.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0xC9

graft_uno.menu.bootloader.no_bootloader=No bootloader
graft_uno.menu.bootloader.no_bootloader.upload.maximum_size=49152
graft_uno.menu.bootloader.no_bootloader.upload.extra_params=
graft_uno.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
graft_uno.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
graft_uno.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00


####################
#### ATmega4809 ####
####################

# General
4809.name=ATmega4809
4809.upload.tool=avrdude
4809.upload.maximum_data_size=6144
4809.upload.speed=115200
4809.bootloader.tool=avrdude
4809.build.core=coreX-corefiles
4809.build.board=AVR_ATmega4809
4809.build.mcu=atmega4809
4809.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
4809.bootloader.WDTCFG=0x00
4809.bootloader.TCD0CFG=0x00
4809.bootloader.SYSCFG1=0x06
4809.bootloader.APPEND=0x00
4809.bootloader.LOCKBIT=0xC5

# Pinouts
4809.menu.pinout.48pin_standard=40/48 pin standard
4809.menu.pinout.48pin_standard.build.variant=48pin-standard
4809.menu.pinout.48pin_standard.build.compat=
4809.menu.pinout.uno_wifi=Uno WiFi
4809.menu.pinout.uno_wifi.build.variant=uno-wifi
4809.menu.pinout.uno_wifi.build.compat=

4809.menu.pinout.nano_every=Nano Every
4809.menu.pinout.nano_every.build.variant=nano-every
4809.menu.pinout.nano_every.upload.tool=avrdude_nanoevery
4809.menu.pinout.nano_every.upload.use_1200bps_touch=true
4809.menu.pinout.nano_every.upload.protocol=jtag2updi
4809.menu.pinout.nano_every.program.extra_params=-P{serial.port} -e
4809.menu.pinout.nano_every.build.compat=

# Reset pin
4809.menu.resetpin.reset=Reset
4809.menu.resetpin.reset.bootloader.SYSCFG0=0xC9
4809.menu.resetpin.gpio=GPIO
4809.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
4809.menu.BOD.2v6=BOD 2.6V
4809.menu.BOD.2v6.bootloader.BODCFG=0x54
4809.menu.BOD.4v2=BOD 4.2V
4809.menu.BOD.4v2.bootloader.BODCFG=0xF4
4809.menu.BOD.4v0=BOD 4.0V
4809.menu.BOD.4v0.bootloader.BODCFG=0xD4
4809.menu.BOD.3v7=BOD 3.7V
4809.menu.BOD.3v7.bootloader.BODCFG=0xB4
4809.menu.BOD.3v3=BOD 3.3V
4809.menu.BOD.3v3.bootloader.BODCFG=0x94
4809.menu.BOD.2v9=BOD 2.9V
4809.menu.BOD.2v9.bootloader.BODCFG=0x74
4809.menu.BOD.2v1=BOD 2.1V
4809.menu.BOD.2v1.bootloader.BODCFG=0x34
4809.menu.BOD.1v8=BOD 1.8V
4809.menu.BOD.1v8.bootloader.BODCFG=0x14
4809.menu.BOD.disabled=BOD disabled
4809.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
4809.menu.clock.internal_16MHz=Internal 16 MHz
4809.menu.clock.internal_16MHz.upload.speed=115200
4809.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
4809.menu.clock.internal_16MHz.build.oscillator=
4809.menu.clock.internal_16MHz.build.f_cpu=16000000L

4809.menu.clock.internal_20MHz=Internal 20 MHz
4809.menu.clock.internal_20MHz.upload.speed=115200
4809.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
4809.menu.clock.internal_20MHz.build.oscillator=
4809.menu.clock.internal_20MHz.build.f_cpu=20000000L

4809.menu.clock.internal_8MHz_div=Internal 8 MHz
4809.menu.clock.internal_8MHz_div.upload.speed=115200
4809.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
4809.menu.clock.internal_8MHz_div.build.oscillator=
4809.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

4809.menu.clock.internal_4MHz_div=Internal 4 MHz
4809.menu.clock.internal_4MHz_div.upload.speed=115200
4809.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
4809.menu.clock.internal_4MHz_div.build.oscillator=
4809.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

