SmartkomDev/GraftCore/graftcore/boards.txt
####################
#### ATmega1608 ####
####################

# General
1608.name=ATmega1608
1608.upload.tool=avrdude
1608.upload.maximum_data_size=2048
1608.upload.speed=115200
1608.bootloader.tool=avrdude
1608.build.core=coreX-corefiles
1608.build.board=AVR_ATmega1608
1608.build.mcu=atmega1608
1608.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
1608.bootloader.WDTCFG=0x00
1608.bootloader.TCD0CFG=0x00
1608.bootloader.SYSCFG1=0x06
1608.bootloader.APPEND=0x00
1608.bootloader.LOCKBIT=0xC5

# Pinouts
1608.menu.pinout.32pin_standard=32 pin standard
1608.menu.pinout.32pin_standard.build.variant=32pin-standard
1608.menu.pinout.28pin_standard=28 pin standard
1608.menu.pinout.28pin_standard.build.variant=28pin-standard

# Reset pin
1608.menu.resetpin.reset=Reset
1608.menu.resetpin.reset.bootloader.SYSCFG0=0xCD
1608.menu.resetpin.gpio=GPIO
1608.menu.resetpin.gpio.bootloader.SYSCFG0=0xC5

# Brown out detection
1608.menu.BOD.2v6=BOD 2.6V
1608.menu.BOD.2v6.bootloader.BODCFG=0x54
1608.menu.BOD.4v2=BOD 4.2V
1608.menu.BOD.4v2.bootloader.BODCFG=0xF4
1608.menu.BOD.4v0=BOD 4.0V
1608.menu.BOD.4v0.bootloader.BODCFG=0xD4
1608.menu.BOD.3v7=BOD 3.7V
1608.menu.BOD.3v7.bootloader.BODCFG=0xB4
1608.menu.BOD.3v3=BOD 3.3V
1608.menu.BOD.3v3.bootloader.BODCFG=0x94
1608.menu.BOD.2v9=BOD 2.9V
1608.menu.BOD.2v9.bootloader.BODCFG=0x74
1608.menu.BOD.2v1=BOD 2.1V
1608.menu.BOD.2v1.bootloader.BODCFG=0x34
1608.menu.BOD.1v8=BOD 1.8V
1608.menu.BOD.1v8.bootloader.BODCFG=0x14
1608.menu.BOD.disabled=BOD disabled
1608.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
1608.menu.clock.internal_16MHz=Internal 16 MHz
1608.menu.clock.internal_16MHz.upload.speed=115200
1608.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
1608.menu.clock.internal_16MHz.build.oscillator=
1608.menu.clock.internal_16MHz.build.f_cpu=16000000L

1608.menu.clock.internal_20MHz=Internal 20 MHz
1608.menu.clock.internal_20MHz.upload.speed=115200
1608.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
1608.menu.clock.internal_20MHz.build.oscillator=
1608.menu.clock.internal_20MHz.build.f_cpu=20000000L

1608.menu.clock.internal_8MHz_div=Internal 8 MHz
1608.menu.clock.internal_8MHz_div.upload.speed=115200
1608.menu.clock.internal_8MHz_div.bootloader.OSCCFG=0x01
1608.menu.clock.internal_8MHz_div.build.oscillator=
1608.menu.clock.internal_8MHz_div.build.f_cpu=8000000L

1608.menu.clock.internal_4MHz_div=Internal 4 MHz
1608.menu.clock.internal_4MHz_div.upload.speed=115200
1608.menu.clock.internal_4MHz_div.bootloader.OSCCFG=0x01
1608.menu.clock.internal_4MHz_div.build.oscillator=
1608.menu.clock.internal_4MHz_div.build.f_cpu=4000000L

1608.menu.clock.internal_2MHz_div=Internal 2 MHz
1608.menu.clock.internal_2MHz_div.upload.speed=115200
1608.menu.clock.internal_2MHz_div.bootloader.OSCCFG=0x01
1608.menu.clock.internal_2MHz_div.build.oscillator=
1608.menu.clock.internal_2MHz_div.build.f_cpu=2000000L

1608.menu.clock.internal_1MHz_div=Internal 1 MHz
1608.menu.clock.internal_1MHz_div.upload.speed=115200
1608.menu.clock.internal_1MHz_div.bootloader.OSCCFG=0x01
1608.menu.clock.internal_1MHz_div.build.oscillator=
1608.menu.clock.internal_1MHz_div.build.f_cpu=1000000L

1608.menu.clock.external_16MHz=External 16 MHz
1608.menu.clock.external_16MHz.upload.speed=115200
1608.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_16MHz.build.f_cpu=16000000L

1608.menu.clock.external_12MHz=External 12 MHz
1608.menu.clock.external_12MHz.upload.speed=115200
1608.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_12MHz.build.f_cpu=12000000L

1608.menu.clock.external_8MHz=External 8 MHz
1608.menu.clock.external_8MHz.upload.speed=115200
1608.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_8MHz.build.f_cpu=8000000L

1608.menu.clock.external_4MHz=External 4 MHz
1608.menu.clock.external_4MHz.upload.speed=115200
1608.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_4MHz.build.f_cpu=4000000L

1608.menu.clock.external_1MHz=External 1 MHz
1608.menu.clock.external_1MHz.upload.speed=115200
1608.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_1MHz.build.f_cpu=1000000L

# Bootloader
1608.menu.bootloader.no_bootloader=No bootloader
1608.menu.bootloader.no_bootloader.upload.maximum_size=16384
1608.menu.bootloader.no_bootloader.upload.extra_params=
1608.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
1608.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
1608.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00

1608.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
1608.menu.bootloader.uart0_default.upload.maximum_size=15872
1608.menu.bootloader.uart0_default.upload.protocol=arduino
1608.menu.bootloader.uart0_default.upload.port=UART0_DEF
1608.menu.bootloader.uart0_default.upload.extra_params=
1608.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
1608.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart0_default.bootloader.SYSCFG0=0xC9

1608.menu.bootloader.uart0_alternative=Optiboot (UART0 alternative pins)
1608.menu.bootloader.uart0_alternative.upload.maximum_size=15872
1608.menu.bootloader.uart0_alternative.upload.protocol=arduino
1608.menu.bootloader.uart0_alternative.upload.port=UART0_ALT
1608.menu.bootloader.uart0_alternative.upload.extra_params=
1608.menu.bootloader.uart0_alternative.build.text_section_start=.text=0x200
1608.menu.bootloader.uart0_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart0_alternative.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart0_alternative.bootloader.SYSCFG0=0xC9

